perf-testing/3.x/oauth/oauth-3x.log
Gateway Benchmark Results - RHOAI 3.x with OAuth
Generated: Mon Nov 17 12:03:18 PM CST 2025
Configuration: 10000 requests, 50 concurrency, 5 iterations
Gateway URL: https://data-science-gateway.apps.rosa.f3d4c3l4i5u4x1v.fcu6.p3.openshiftapps.com/echo

================================================================================

=== ITERATION 1 ===
Started: Mon Nov 17 12:03:41 PM CST 2025


Summary:
  Total:	339.5506 secs
  Slowest:	5.0943 secs
  Fastest:	0.0539 secs
  Average:	1.6685 secs
  Requests/sec:	29.4507
  
  Total data:	139972 bytes
  Size/request:	13 bytes

Response time histogram:
  0.054 [1]	|
  0.558 [614]	|■■■■■■■■■■
  1.062 [1733]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.566 [2557]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.070 [2272]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.574 [1487]	|■■■■■■■■■■■■■■■■■■■■■■■
  3.078 [761]	|■■■■■■■■■■■■
  3.582 [351]	|■■■■■
  4.086 [149]	|■■
  4.590 [54]	|■
  5.094 [21]	|


Latency distribution:
  10% in 0.6984 secs
  25% in 1.0987 secs
  50% in 1.5958 secs
  75% in 2.1753 secs
  90% in 2.7541 secs
  95% in 3.1205 secs
  99% in 3.9918 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0539 secs, 5.0943 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0026 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0020 secs
  resp wait:	1.6678 secs, 0.0537 secs, 5.0941 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0037 secs

Status code distribution:
  [200]	9998 responses
  [403]	2 responses



Completed: Mon Nov 17 12:09:22 PM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 2 ===
Started: Mon Nov 17 12:09:32 PM CST 2025


Summary:
  Total:	344.3669 secs
  Slowest:	5.1367 secs
  Fastest:	0.0530 secs
  Average:	1.6887 secs
  Requests/sec:	29.0388
  
  Total data:	139972 bytes
  Size/request:	13 bytes

Response time histogram:
  0.053 [1]	|
  0.561 [566]	|■■■■■■■■■■
  1.070 [1835]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.578 [2277]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.086 [2305]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.595 [1618]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.103 [845]	|■■■■■■■■■■■■■■■
  3.612 [353]	|■■■■■■
  4.120 [137]	|■■
  4.628 [50]	|■
  5.137 [13]	|


Latency distribution:
  10% in 0.7052 secs
  25% in 1.0949 secs
  50% in 1.6057 secs
  75% in 2.1980 secs
  90% in 2.7968 secs
  95% in 3.1971 secs
  99% in 4.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0008 secs, 0.0530 secs, 5.1367 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0451 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0020 secs
  resp wait:	1.6877 secs, 0.0529 secs, 5.1366 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0030 secs

Status code distribution:
  [200]	9998 responses
  [403]	2 responses



Completed: Mon Nov 17 12:15:19 PM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 3 ===
Started: Mon Nov 17 12:15:29 PM CST 2025


Summary:
  Total:	348.1595 secs
  Slowest:	5.1181 secs
  Fastest:	0.0520 secs
  Average:	1.7141 secs
  Requests/sec:	28.7225
  
  Total data:	139916 bytes
  Size/request:	13 bytes

Response time histogram:
  0.052 [1]	|
  0.559 [492]	|■■■■■■■■
  1.065 [1598]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.572 [2488]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.078 [2354]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.585 [1741]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.092 [778]	|■■■■■■■■■■■■■
  3.598 [339]	|■■■■■
  4.105 [138]	|■■
  4.612 [52]	|■
  5.118 [19]	|


Latency distribution:
  10% in 0.7435 secs
  25% in 1.1270 secs
  50% in 1.6388 secs
  75% in 2.1991 secs
  90% in 2.7043 secs
  95% in 3.1157 secs
  99% in 3.9670 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0008 secs, 0.0520 secs, 5.1181 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0595 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0017 secs
  resp wait:	1.7130 secs, 0.0520 secs, 5.1179 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0033 secs

Status code distribution:
  [200]	9994 responses
  [403]	6 responses



Completed: Mon Nov 17 12:21:19 PM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 4 ===
Started: Mon Nov 17 12:21:29 PM CST 2025


Summary:
  Total:	349.0654 secs
  Slowest:	5.1459 secs
  Fastest:	0.0541 secs
  Average:	1.7105 secs
  Requests/sec:	28.6479
  
  Total data:	139888 bytes
  Size/request:	13 bytes

Response time histogram:
  0.054 [1]	|
  0.563 [651]	|■■■■■■■■■■■
  1.072 [1574]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.582 [2373]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.091 [2410]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.600 [1624]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.109 [838]	|■■■■■■■■■■■■■■
  3.618 [314]	|■■■■■
  4.128 [138]	|■■
  4.637 [59]	|■
  5.146 [18]	|


Latency distribution:
  10% in 0.7027 secs
  25% in 1.1288 secs
  50% in 1.6392 secs
  75% in 2.1991 secs
  90% in 2.7996 secs
  95% in 3.1559 secs
  99% in 3.9994 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0541 secs, 5.1459 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0381 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0022 secs
  resp wait:	1.7095 secs, 0.0539 secs, 5.1457 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0038 secs

Status code distribution:
  [200]	9992 responses
  [403]	8 responses



Completed: Mon Nov 17 12:27:20 PM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 5 ===
Started: Mon Nov 17 12:27:30 PM CST 2025


Summary:
  Total:	340.2409 secs
  Slowest:	5.1023 secs
  Fastest:	0.0504 secs
  Average:	1.6710 secs
  Requests/sec:	29.3909
  
  Total data:	139972 bytes
  Size/request:	13 bytes

Response time histogram:
  0.050 [1]	|
  0.556 [627]	|■■■■■■■■■■
  1.061 [1735]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.566 [2405]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.071 [2332]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.576 [1586]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.082 [774]	|■■■■■■■■■■■■■
  3.587 [335]	|■■■■■■
  4.092 [154]	|■■■
  4.597 [39]	|■
  5.102 [12]	|


Latency distribution:
  10% in 0.6989 secs
  25% in 1.0977 secs
  50% in 1.6001 secs
  75% in 2.1917 secs
  90% in 2.7257 secs
  95% in 3.1005 secs
  99% in 3.8707 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0504 secs, 5.1023 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0472 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0026 secs
  resp wait:	1.6680 secs, 0.0503 secs, 5.1021 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0043 secs

Status code distribution:
  [200]	9998 responses
  [403]	2 responses



Completed: Mon Nov 17 12:33:13 PM CST 2025

--------------------------------------------------------------------------------