perf-testing/3.x/oauth/oauth-3x.log
Gateway Benchmark Results - RHOAI 3.x with OAuth
Generated: Tue Nov 18 09:06:21 AM CST 2025
Configuration: 10000 requests, 50 concurrency, 5 iterations
Gateway URL: https://data-science-gateway.apps.rosa.f3d4c3l4i5u4x1v.fcu6.p3.openshiftapps.com/echo

================================================================================

=== ITERATION 1 ===
Started: Tue Nov 18 09:06:24 AM CST 2025


Summary:
  Total:	14.3080 secs
  Slowest:	0.3282 secs
  Fastest:	0.0476 secs
  Average:	0.0702 secs
  Requests/sec:	698.9104
  
  Total data:	140000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.048 [1]	|
  0.076 [6989]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.104 [2825]	|■■■■■■■■■■■■■■■■
  0.132 [120]	|■
  0.160 [23]	|
  0.188 [30]	|
  0.216 [11]	|
  0.244 [0]	|
  0.272 [0]	|
  0.300 [0]	|
  0.328 [1]	|


Latency distribution:
  10% in 0.0550 secs
  25% in 0.0596 secs
  50% in 0.0686 secs
  75% in 0.0775 secs
  90% in 0.0860 secs
  95% in 0.0921 secs
  99% in 0.1157 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0476 secs, 0.3282 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0018 secs
  resp wait:	0.0696 secs, 0.0474 secs, 0.3280 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0031 secs

Status code distribution:
  [200]	10000 responses



Completed: Tue Nov 18 09:06:41 AM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 2 ===
Started: Tue Nov 18 09:06:51 AM CST 2025


Summary:
  Total:	16.3199 secs
  Slowest:	0.3802 secs
  Fastest:	0.0476 secs
  Average:	0.0800 secs
  Requests/sec:	612.7484
  
  Total data:	140000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.048 [1]	|
  0.081 [7013]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.114 [2298]	|■■■■■■■■■■■■■
  0.147 [169]	|■
  0.181 [82]	|
  0.214 [384]	|■■
  0.247 [0]	|
  0.280 [0]	|
  0.314 [1]	|
  0.347 [42]	|
  0.380 [10]	|


Latency distribution:
  10% in 0.0551 secs
  25% in 0.0618 secs
  50% in 0.0718 secs
  75% in 0.0833 secs
  90% in 0.1011 secs
  95% in 0.1597 secs
  99% in 0.2069 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0476 secs, 0.3802 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0023 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0018 secs
  resp wait:	0.0793 secs, 0.0474 secs, 0.3790 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0037 secs

Status code distribution:
  [200]	10000 responses



Completed: Tue Nov 18 09:07:09 AM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 3 ===
Started: Tue Nov 18 09:07:19 AM CST 2025


Summary:
  Total:	15.1640 secs
  Slowest:	0.2147 secs
  Fastest:	0.0481 secs
  Average:	0.0737 secs
  Requests/sec:	659.4557
  
  Total data:	140000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.048 [1]	|
  0.065 [3200]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.081 [4293]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.098 [1794]	|■■■■■■■■■■■■■■■■■
  0.115 [537]	|■■■■■
  0.131 [90]	|■
  0.148 [28]	|
  0.165 [8]	|
  0.181 [7]	|
  0.198 [6]	|
  0.215 [36]	|


Latency distribution:
  10% in 0.0554 secs
  25% in 0.0618 secs
  50% in 0.0713 secs
  75% in 0.0814 secs
  90% in 0.0933 secs
  95% in 0.1025 secs
  99% in 0.1269 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0481 secs, 0.2147 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0021 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0019 secs
  resp wait:	0.0730 secs, 0.0480 secs, 0.1703 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0031 secs

Status code distribution:
  [200]	10000 responses



Completed: Tue Nov 18 09:07:36 AM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 4 ===
Started: Tue Nov 18 09:07:46 AM CST 2025


Summary:
  Total:	14.2978 secs
  Slowest:	0.2326 secs
  Fastest:	0.0477 secs
  Average:	0.0701 secs
  Requests/sec:	699.4059
  
  Total data:	140000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.048 [1]	|
  0.066 [4421]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.085 [4521]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.103 [865]	|■■■■■■■■
  0.122 [129]	|■
  0.140 [13]	|
  0.159 [0]	|
  0.177 [0]	|
  0.196 [15]	|
  0.214 [7]	|
  0.233 [28]	|


Latency distribution:
  10% in 0.0549 secs
  25% in 0.0599 secs
  50% in 0.0681 secs
  75% in 0.0774 secs
  90% in 0.0852 secs
  95% in 0.0921 secs
  99% in 0.1126 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0477 secs, 0.2326 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0234 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0016 secs
  resp wait:	0.0693 secs, 0.0476 secs, 0.1370 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0025 secs

Status code distribution:
  [200]	10000 responses



Completed: Tue Nov 18 09:08:03 AM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 5 ===
Started: Tue Nov 18 09:08:13 AM CST 2025


Summary:
  Total:	14.9602 secs
  Slowest:	0.2942 secs
  Fastest:	0.0472 secs
  Average:	0.0731 secs
  Requests/sec:	668.4411
  
  Total data:	140000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.047 [1]	|
  0.072 [5546]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.097 [3629]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.121 [665]	|■■■■■
  0.146 [102]	|■
  0.171 [12]	|
  0.195 [24]	|
  0.220 [20]	|
  0.245 [0]	|
  0.269 [0]	|
  0.294 [1]	|


Latency distribution:
  10% in 0.0552 secs
  25% in 0.0611 secs
  50% in 0.0698 secs
  75% in 0.0806 secs
  90% in 0.0933 secs
  95% in 0.1040 secs
  99% in 0.1293 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0472 secs, 0.2942 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0018 secs
  resp wait:	0.0723 secs, 0.0471 secs, 0.2940 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0026 secs

Status code distribution:
  [200]	10000 responses



Completed: Tue Nov 18 09:08:29 AM CST 2025

--------------------------------------------------------------------------------